# Import libraries

In [217]:
import pandas as pd
import numpy as np
import os

# Importing Data

In [219]:
path =  r"C:\Users\hp\08-08-2024 Instacart Basket Analysis"
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'), index_col = False)
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [220]:
df_ords.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [221]:
df_ords.shape

(3421083, 7)

# Test DF for mix type data

In [223]:
#Create a test Dataframe
df_test = pd.DataFrame()

In [224]:
# Create a mix type column
df_test['date']= ['a', 2, 3, 4]

In [225]:
df_test.head()

  date
0    a
1    2
2    3
3    4

In [226]:
# Check for mix types
for col in df_test.columns.tolist():
    weird = (df_test [[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_test[weird]) > 0:
        print(col)

date

In [227]:
# changing datatype to string
df_test['date'] = df_test['date'].astype('str')

# Checking missing values in products dataframe

In [229]:
# Checking missing values in products dataframe
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [230]:
# Create a new dataframe with missing values in products.csv
df_nan = df_prods[df_prods['product_name'].isnull () ==True]

In [231]:
df_nan.shape

(16, 5)

In [232]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [233]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [234]:
df_prods.shape

(49693, 5)

## Extract the data frame without the missing values and rename it as df_prods_clean

In [236]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [237]:
df_prods_clean.shape

(49677, 5)

In [238]:
# Finding duplicates from prods.csv data frame
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [239]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [240]:
# before dealing with the duplicates check the shape i.e., rows and columns and then work on it
df_prods_clean.shape

(49677, 5)

In [241]:
# removing duplicates and creating a new dataframe
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [242]:
# now check the shape of new dataframe to check if the drop function was successful
df_prods_clean_no_dups.shape

(49672, 5)

In [243]:
# observation: 5 rows deleted

In [244]:
#exporting the cleaned dataframe
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_cleaned.csv'))

# Task 4.5

## Step 3 & 4 Check the Mix type and fix it on orders dataframe

In [247]:
df_ords.describe ()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [248]:
df_ords.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

## Observation:

In [250]:
 #Order day of week has min value of 0 and max of 6 i.e., total of 7 days in a week.
# Its safe to consider that the column order_dow is consistent. 
#min value of order_hour_of_day is 0 or mid night and max is 23 or night 11 pm. This is a consistent data.
# Interpretation from mean: common day of orders were day 3 i.e., Tuesday and most common time of the day is 13 or 1 pm. 
# Mean or most orders placed were after 11 days.
# other columns except order_dow, order_hour_of_day, days_since_prior_order should be a string data type.

In [251]:
#checking for mix data types

for col in df_ords.columns.tolist():
    weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1) 
    if len (df_ords[weird]) > 0:
        print(col)

In [252]:
#Observation: as there is no output,that means there are no mix data types

## Step 5 Check missing values on orders dataframe

In [254]:
df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

## Step 6 Address missing values

In [256]:
df_ords.shape

(3421083, 7)

In [257]:
#imputing missing values with 0

In [258]:
df_ords['days_since_prior_order'] = df_ords['days_since_prior_order'].fillna(0)

In [259]:
df_ords

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,0.0
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0
...,...,...,...,...,...,...,...
3421078,2266710,206209,prior,10,5,18,29.0
3421079,1854736,206209,prior,11,4,10,30.0
3421080,626363,206209,prior,12,1,12,18.0
3421081,2977660,206209,prior,13,1,12,7.0
3421082,272231,206209,train,14,6,14,30.0

# Step 7 Check duplicates

In [304]:
df_ords[df_ords.duplicated()]

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order]
Index: []

In [306]:
df_ords

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,0.0
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0
...,...,...,...,...,...,...,...
3421078,2266710,206209,prior,10,5,18,29.0
3421079,1854736,206209,prior,11,4,10,30.0
3421080,626363,206209,prior,12,1,12,18.0
3421081,2977660,206209,prior,13,1,12,7.0
3421082,272231,206209,train,14,6,14,30.0

In [263]:
#there are no duplicates in orders.csv

In [1]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked_4.5.csv'))

NameError: name 'df_ords' is not defined